NonVoucherRecharge.xml

<soapenv:Envelope xmlns:ccws="http://comverse-in.com/prepaid/ccws"
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<wsse:Security soapenv:mustUnderstand="1"
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:UsernameToken wsu:Id="UsernameToken-17709078"
				xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
				<wsse:Username>${username}</wsse:Username>
				<wsse:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">${password}</wsse:Password>
				<wsse:Nonce>WYmMF1Sz4e/LbEwfhiZxJg==</wsse:Nonce>
				<wsu:Created>${date}</wsu:Created>
			</wsse:UsernameToken>
		</wsse:Security>
		<ccws:VersionInfoHeader>
			<ccws:ProductVersion />
			<ccws:CustomerVersion />
		</ccws:VersionInfoHeader>
	</soapenv:Header>
	<soapenv:Body>
		<ccws:NonVoucherRecharge>
			<ccws:subscriberId>${suscriberID}</ccws:subscriberId>
			<ccws:rechValue>2.1</ccws:rechValue>
			<ccws:rechComm>${rechComm}</ccws:rechComm>
		</ccws:NonVoucherRecharge>
	</soapenv:Body>
</soapenv:Envelope>